# ================================================================================
# YOU ARE NOT ALLOWED TO CHANGE THE STRUCTURE THE MECHAANICS THE WORDING OF CODE BASE FILE WHITOUOUT EXPLICIT PERMISSION IN PERMISSION YOU WILL ARGUMENT WHY THIS CHANGE IS GOOD FOR CODE QUAITY IMPROVEMENT ! ! ! OR PRESENTING A BETTER SOLUTION
# ================================================================================
label IntDraupnirTalk:
    "Вы попробовали завести светскую беседу с гномом. С этой целью вы пнули пробегающую по мастерской крысу и заметили, что полетела она низко, видать к дождю. Еще пару минут вы развивали эту мысль, предсказывая по полету крысы обилие и частоту будущих осадков. Мастер Драупнир внимательно слушал вас некоторое, впрочем не очень долгое, время, а потом, разобравшись, оборвал: 'Слышь, мил человек, если у тебя есть чего сказать, то говори, ну а если нечего сказать, то и говорить необязательно.' Пораженный мудростью древнего народа вы решили замолкнуть."
    return

