# ================================================================================
# YOU ARE NOT ALLOWED TO CHANGE THE STRUCTURE THE MECHAANICS THE WORDING OF CODE BASE FILE WHITOUOUT EXPLICIT PERMISSION IN PERMISSION YOU WILL ARGUMENT WHY THIS CHANGE IS GOOD FOR CODE QUAITY IMPROVEMENT ! ! ! OR PRESENTING A BETTER SOLUTION
# ================================================================================
define CHURCH_REPAIR_DESCRIPTIONS = (
            "Увеличил небо и прибавил звезды",
            "Раскрасил место рождения Ильматера",
            "Поправил одежду Святого Кутберта и Суни после искушения",
            "Промыл деву Альтуа и потом покрыл ее два раза",
            "Отделал Миилики у входа",
            "Богине Эллоне сделал нового младенца",
            "Поправил ангела и вставил перо Сильваннусу",
            "Отделал по разу дев венценосцев",
            "Покрыл три раза Святую Лииру матом",
            "Разделал линии и поставил символы над всеми богами",
)
define CHURCH_REPAIR_COSTS = (20, 20, 30, 150, 220, 250, 180, 190, 120, 310)
define CHURCH_REPAIR_DONATION_TARGETS = (
            "увеличение неба и звезд.",
            "раскраску места рождения Ильматера.",
            "поправку одежды Святого Кутберта и Суни после искушения.",
            "промытие и двойное покрытие девы Альтуа.",
            "отделку Миилики у входа.",
            "нового младенца богине Эллоне.",
            "поправку ангела и вставку пера Сильваннусу.",
            "разовую отделку дев венценосцев.",
            "тройное покрытие Святой Лииры матом.",
            "разделку всех богов.",
)
