label CreateDonationsList:
    python:
        ChurchRepairDesc = [
            "Увеличил небо и прибавил звезды",
            "Раскрасил место рождения Ильматера",
            "Поправил одежду Святого Кутберта и Суни после искушения",
            "Промыл деву Альтуа и потом покрыл ее два раза",
            "Отделал Миилики у входа",
            "Богине Эллоне сделал нового младенца",
            "Поправил ангела и вставил перо Сильваннусу",
            "Отделал по разу дев венценосцев",
            "Покрыл три раза Святую Лииру матом",
            "Разделал линии и поставил символы над всеми богами",
        ]
        ChurchRepairCost = [20, 20, 30, 150, 220, 250, 180, 190, 120, 310]
        ChurchRepairDonat = [
            "увеличение неба и звезд.",
            "раскраску места рождения Ильматера.",
            "поправку одежды Святого Кутберта и Суни после искушения.",
            "промытие и двойное покрытие девы Альтуа.",
            "отделку Миилики у входа.",
            "нового младенца богине Эллоне.",
            "поправку ангела и вставку пера Сильваннусу.",
            "разовую отделку дев венценосцев.",
            "тройное покрытие Святой Лииры матом.",
            "разделку всех богов.",
        ]
        ChurchDonated = [0 for _unused_repair in ChurchRepairDesc]

        SawDraupnirChurchList = 0
        ChurchDonatedToday = 0
        ChurchDonatedAmount = 0
    return
